<details ><summary>plan for dev 2025-06-13 23:02:20 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project diggerhq/states-test#dev has been locked by PR #8
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_ssm_parameter.example_secret must be replaced
-/+ resource "aws_ssm_parameter" "example_secret" {
      ~ arn            = "arn:aws:ssm:us-east-1:739940681129:parameter/dev/example/secret" -> (known after apply)
      ~ data_type      = "text" -> (known after apply)
      ~ id             = "/dev/example/secret" -> (known after apply)
      + insecure_value = (known after apply)
      ~ key_id         = "alias/aws/ssm" -> (known after apply)
      ~ name           = "/dev/example/secret" -> "/dev/example/secret/" # forces replacement
        tags           = {
            "Environment" = "dev"
        }
      ~ tier           = "Standard" -> (known after apply)
      ~ version        = 1 -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + example_secret = "filterme: abc123"

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (dev)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
|  CHANGE  |              RESOURCE              |
|----------|------------------------------------|
| recreate | `aws_ssm_parameter.example_secret` |

| CHANGE |      OUTPUT      |
|--------|------------------|
| add    | `example_secret` |

</details>

</details>